# Маніпулювання даними за допомогою `dplyr`

## 0. Інсталяція та завантаження пакету

In [1]:
# install.packages("dplyr")

In [2]:
library(dplyr)

Attaching package: 'dplyr'


The following objects are masked from 'package:stats':

    filter, lag


The following objects are masked from 'package:base':

    intersect, setdiff, setequal, union

## 1. Оператор `pipe`: `|>`, `%>%`

In [3]:
set.seed(2025)
data <- data.frame(
    Gender = c("M", "M", "F", "F", "M", "F"),
    Age = sample(12:40, size = 6),
    X = c(T,F,F,F,T,T))
data

  Gender Age X
1 M      24   TRUE
2 M      23  FALSE
3 F      15  FALSE
4 F      37  FALSE
5 M      12   TRUE
6 F      34   TRUE

In [4]:
data |> select(Gender, Age)

  Gender Age
1 M      24
2 M      23
3 F      15
4 F      37
5 M      12
6 F      34

In [5]:
data |> 
    select(Gender, Age) |> 
    filter(Age > 18)

  Gender Age
1 M      24
2 M      23
3 F      37
4 F      34

In [6]:
data |> 
    select(Gender, Age) |> 
    filter(Age > 18) |>
    group_by(Gender) |>
    summarise(avg_age = mean(Age))

  Gender avg_age
1 F      35.5
2 M      23.5

## 3. Огляд набору даних

In [7]:
# install.packages("gapminder")

In [8]:
library(gapminder)

In [9]:
?gapminder

gapminder              package:gapminder               R Documentation

_G_a_p_m_i_n_d_e_r _d_a_t_a

_D_e_s_c_r_i_p_t_i_o_n:

     Excerpt of the Gapminder data on life expectancy, GDP per capita,
     and population by country.

_U_s_a_g_e:

     gapminder

_F_o_r_m_a_t:

     The main data frame 'gapminder' has 1704 rows and 6 variables:

     country factor with 142 levels

     continent factor with 5 levels

     year ranges from 1952 to 2007 in increments of 5 years

     lifeExp life expectancy at birth, in years

     pop population

     gdpPercap GDP per capita (US$, inflation-adjusted)

     The supplemental data frame 'gapminder_unfiltered' was not
     filtered on 'year' or for complete data and has 3313 rows.

_S_o_u_r_c_e:

     <URL: https://www.gapminder.org/data/>

_S_e_e _A_l_s_o:

     'country_colors' for a nice color scheme for the countries

_E_x_a_m_p_l_e_s:

     str(gapminder)
     head(gapminder)
     summary(gapminder)
     table(gapminder$continent)
     aggregate(lifeExp ~ continent, gapminder, median)
     plot(lifeExp ~ year, gapminder, subset = country == "Cambodia", type = "b")
     plot(lifeExp ~ gdpPercap, gapminder, subset = year == 2007, log = "x")

     if (require("dplyr")) {
       gapminder %>%
         filter(year == 2007) %>%
         group_by(continent) %>%
         summarise(lifeExp = median(lifeExp))

       # how many unique countries does the data contain, by continent?
       gapminder %>%
         group_by(continent) %>%
         summarize(n_obs = n(), n_countries = n_distinct(country))

       # by continent, which country experienced the sharpest 5-year drop in
       # life expectancy and what was the drop?
       gapminder %>%
         group_by(continent, country) %>%
         select(country, year, continent, lifeExp) %>%
         mutate(le_delta = lifeExp - lag(lifeExp)) %>%
         summarize(worst_le_delta = min(le_delta, na.rm = TRUE)) %>%
         filter(min_rank(worst_le_delta) < 2) %>%
         arrange(worst_le_delta)
     }

In [10]:
str(gapminder)

tibble [1,704 x 6] (S3: tbl_df/tbl/data.frame)
 $ country  : Factor w/ 142 levels "Afghanistan",..: 1 1 1 1 1 1 1 1 1 1 ...
 $ continent: Factor w/ 5 levels "Africa","Americas",..: 3 3 3 3 3 3 3 3 3 3 ...
 $ year     : int [1:1704] 1952 1957 1962 1967 1972 1977 1982 1987 1992 1997 ...
 $ lifeExp  : num [1:1704] 28.8 30.3 32 34 36.1 ...
 $ pop      : int [1:1704] 8425333 9240934 10267083 11537966 13079460 14880372 12881816 13867957 16317921 22227415 ...
 $ gdpPercap: num [1:1704] 779 821 853 836 740 ...

In [11]:
glimpse(gapminder)

Rows: 1,704
Columns: 6
$ country   <fct> "Afghanistan", "Afghanistan", "Afghanistan", "Afghanistan", ~
$ continent <fct> Asia, Asia, Asia, Asia, Asia, Asia, Asia, Asia, Asia, Asia, ~
$ year      <int> 1952, 1957, 1962, 1967, 1972, 1977, 1982, 1987, 1992, 1997, ~
$ lifeExp   <dbl> 28.801, 30.332, 31.997, 34.020, 36.088, 38.438, 39.854, 40.8~
$ pop       <int> 8425333, 9240934, 10267083, 11537966, 13079460, 14880372, 12~
$ gdpPercap <dbl> 779.4453, 820.8530, 853.1007, 836.1971, 739.9811, 786.1134, ~

In [12]:
head(gapminder)

  country     continent year lifeExp pop      gdpPercap
1 Afghanistan Asia      1952 28.801   8425333 779.4453
2 Afghanistan Asia      1957 30.332   9240934 820.8530
3 Afghanistan Asia      1962 31.997  10267083 853.1007
4 Afghanistan Asia      1967 34.020  11537966 836.1971
5 Afghanistan Asia      1972 36.088  13079460 739.9811
6 Afghanistan Asia      1977 38.438  14880372 786.1134

In [13]:
tail(gapminder)

  country  continent year lifeExp pop      gdpPercap
1 Zimbabwe Africa    1982 60.363   7636524 788.8550
2 Zimbabwe Africa    1987 62.351   9216418 706.1573
3 Zimbabwe Africa    1992 60.377  10704340 693.4208
4 Zimbabwe Africa    1997 46.809  11404948 792.4500
5 Zimbabwe Africa    2002 39.989  11926563 672.0386
6 Zimbabwe Africa    2007 43.487  12311143 469.7093

In [14]:
summary(gapminder)

        country        continent        year         lifeExp
 Afghanistan:  12   Africa  :624   Min.   :1952   Min.   :23.60
 Albania    :  12   Americas:300   1st Qu.:1966   1st Qu.:48.20
 Algeria    :  12   Asia    :396   Median :1980   Median :60.71
 Angola     :  12   Europe  :360   Mean   :1980   Mean   :59.47
 Argentina  :  12   Oceania : 24   3rd Qu.:1993   3rd Qu.:70.85
 Australia  :  12                  Max.   :2007   Max.   :82.60
 (Other)    :1632
      pop              gdpPercap
 Min.   :6.001e+04   Min.   :   241.2
 1st Qu.:2.794e+06   1st Qu.:  1202.1
 Median :7.024e+06   Median :  3531.8
 Mean   :2.960e+07   Mean   :  7215.3
 3rd Qu.:1.959e+07   3rd Qu.:  9325.5
 Max.   :1.319e+09   Max.   :113523.1

## `filter`

In [15]:
data <- gapminder

In [16]:
canada <- filter(data, country == "Canada")

In [17]:
canada <- data |> filter(country == "Canada")

In [18]:
# |> 4.1 
# %>% < 4.09

In [19]:
canada

   country continent year lifeExp pop      gdpPercap
1  Canada  Americas  1952 68.750  14785584 11367.16
2  Canada  Americas  1957 69.960  17010154 12489.95
3  Canada  Americas  1962 71.300  18985849 13462.49
4  Canada  Americas  1967 72.130  20819767 16076.59
5  Canada  Americas  1972 72.880  22284500 18970.57
6  Canada  Americas  1977 74.210  23796400 22090.88
7  Canada  Americas  1982 75.760  25201900 22898.79
8  Canada  Americas  1987 76.860  26549700 26626.52
9  Canada  Americas  1992 77.950  28523502 26342.88
10 Canada  Americas  1997 78.610  30305843 28954.93
11 Canada  Americas  2002 79.770  31902268 33328.97
12 Canada  Americas  2007 80.653  33390141 36319.24

In [20]:
filter(data, lifeExp < 31)

  country      continent year lifeExp pop     gdpPercap
1 Afghanistan  Asia      1952 28.801  8425333  779.4453
2 Afghanistan  Asia      1957 30.332  9240934  820.8530
3 Angola       Africa    1952 30.015  4232095 3520.6103
4 Gambia       Africa    1952 30.000   284320  485.2307
5 Rwanda       Africa    1992 23.599  7290203  737.0686
6 Sierra Leone Africa    1952 30.331  2143249  879.7877

In [21]:
filter(data, country == "Austria", year > 1990)

  country continent year lifeExp pop     gdpPercap
1 Austria Europe    1992 76.040  7914969 27042.02
2 Austria Europe    1997 77.510  8069876 29095.92
3 Austria Europe    2002 78.980  8148312 32417.61
4 Austria Europe    2007 79.829  8199783 36126.49

In [22]:
filter(data, country %in% c("Austria", "Canada"), year > 1990)

  country continent year lifeExp pop      gdpPercap
1 Austria Europe    1992 76.040   7914969 27042.02
2 Austria Europe    1997 77.510   8069876 29095.92
3 Austria Europe    2002 78.980   8148312 32417.61
4 Austria Europe    2007 79.829   8199783 36126.49
5 Canada  Americas  1992 77.950  28523502 26342.88
6 Canada  Americas  1997 78.610  30305843 28954.93
7 Canada  Americas  2002 79.770  31902268 33328.97
8 Canada  Americas  2007 80.653  33390141 36319.24

In [23]:
head(data)

  country     continent year lifeExp pop      gdpPercap
1 Afghanistan Asia      1952 28.801   8425333 779.4453
2 Afghanistan Asia      1957 30.332   9240934 820.8530
3 Afghanistan Asia      1962 31.997  10267083 853.1007
4 Afghanistan Asia      1967 34.020  11537966 836.1971
5 Afghanistan Asia      1972 36.088  13079460 739.9811
6 Afghanistan Asia      1977 38.438  14880372 786.1134

In [24]:
data |> head()

  country     continent year lifeExp pop      gdpPercap
1 Afghanistan Asia      1952 28.801   8425333 779.4453
2 Afghanistan Asia      1957 30.332   9240934 820.8530
3 Afghanistan Asia      1962 31.997  10267083 853.1007
4 Afghanistan Asia      1967 34.020  11537966 836.1971
5 Afghanistan Asia      1972 36.088  13079460 739.9811
6 Afghanistan Asia      1977 38.438  14880372 786.1134

## `select`

In [25]:
data |> 
    select(year, country, pop) |>
    slice(1:12)

   year country     pop
1  1952 Afghanistan  8425333
2  1957 Afghanistan  9240934
3  1962 Afghanistan 10267083
4  1967 Afghanistan 11537966
5  1972 Afghanistan 13079460
6  1977 Afghanistan 14880372
7  1982 Afghanistan 12881816
8  1987 Afghanistan 13867957
9  1992 Afghanistan 16317921
10 1997 Afghanistan 22227415
11 2002 Afghanistan 25268405
12 2007 Afghanistan 31889923

In [26]:
data |> 
    filter(country == "Canada") |>
    select(year, country, pop)

   year country pop
1  1952 Canada  14785584
2  1957 Canada  17010154
3  1962 Canada  18985849
4  1967 Canada  20819767
5  1972 Canada  22284500
6  1977 Canada  23796400
7  1982 Canada  25201900
8  1987 Canada  26549700
9  1992 Canada  28523502
10 1997 Canada  30305843
11 2002 Canada  31902268
12 2007 Canada  33390141

In [27]:
data[data$country == "Canada", c("year", "country", "pop")]

   year country pop
1  1952 Canada  14785584
2  1957 Canada  17010154
3  1962 Canada  18985849
4  1967 Canada  20819767
5  1972 Canada  22284500
6  1977 Canada  23796400
7  1982 Canada  25201900
8  1987 Canada  26549700
9  1992 Canada  28523502
10 1997 Canada  30305843
11 2002 Canada  31902268
12 2007 Canada  33390141

In [28]:
data |> 
    filter(country == "Canada") |>
    select(-gdpPercap, -pop)

   country continent year lifeExp
1  Canada  Americas  1952 68.750
2  Canada  Americas  1957 69.960
3  Canada  Americas  1962 71.300
4  Canada  Americas  1967 72.130
5  Canada  Americas  1972 72.880
6  Canada  Americas  1977 74.210
7  Canada  Americas  1982 75.760
8  Canada  Americas  1987 76.860
9  Canada  Americas  1992 77.950
10 Canada  Americas  1997 78.610
11 Canada  Americas  2002 79.770
12 Canada  Americas  2007 80.653

In [29]:
data |>
    select(!where(is.numeric)) |>
    distinct() |>
    head()

  country     continent
1 Afghanistan Asia
2 Albania     Europe
3 Algeria     Africa
4 Angola      Africa
5 Argentina   Americas
6 Australia   Oceania

## `sample_n`

In [30]:
data_10 <- data |>
    sample_n(10)

In [31]:
data_10

   country    continent year lifeExp pop      gdpPercap
1  Thailand   Asia      1997 67.521  60216677  5852.6255
2  Bulgaria   Europe    1982 71.080   8892098  8224.1916
3  Rwanda     Africa    1977 45.000   4657072   670.0806
4  Egypt      Africa    1972 51.137  34807417  2024.0081
5  Mauritania Africa    2007 64.164   3270065  1803.1515
6  Tunisia    Africa    1962 49.579   4286552  1660.3032
7  Liberia    Africa    1962 40.502   1112796   634.1952
8  Somalia    Africa    1972 40.973   3840161  1254.5761
9  Sri Lanka  Asia      1962 62.192  10421936  1074.4720
10 Germany    Europe    1982 73.800  78335266 22031.5327

In [32]:
data_10_perc <- data |>
    sample_frac(0.1)

In [33]:
nrow(data_10_perc)

[1] 170

In [34]:
data_10_perc |> head()

  country        continent year lifeExp pop       gdpPercap
1 Libya          Africa    1982 62.155    3344074 17364.275
2 Botswana       Africa    1962 51.520     512764   983.654
3 Bolivia        Americas  1997 62.050    7693188  3326.143
4 Gabon          Africa    1992 61.366     985739 13522.158
5 United Kingdom Europe    1962 70.760   53292000 12477.177
6 Japan          Asia      1972 73.420  107188273 14778.786

In [36]:
str(data)

tibble [1,704 x 6] (S3: tbl_df/tbl/data.frame)
 $ country  : Factor w/ 142 levels "Afghanistan",..: 1 1 1 1 1 1 1 1 1 1 ...
 $ continent: Factor w/ 5 levels "Africa","Americas",..: 3 3 3 3 3 3 3 3 3 3 ...
 $ year     : int [1:1704] 1952 1957 1962 1967 1972 1977 1982 1987 1992 1997 ...
 $ lifeExp  : num [1:1704] 28.8 30.3 32 34 36.1 ...
 $ pop      : int [1:1704] 8425333 9240934 10267083 11537966 13079460 14880372 12881816 13867957 16317921 22227415 ...
 $ gdpPercap: num [1:1704] 779 821 853 836 740 ...

## `slice_`

In [42]:
data |> slice(seq(1, 10, 5))

  country     continent year lifeExp pop      gdpPercap
1 Afghanistan Asia      1952 28.801   8425333 779.4453
2 Afghanistan Asia      1977 38.438  14880372 786.1134

In [45]:
data |> slice_head(n = 8)

  country     continent year lifeExp pop      gdpPercap
1 Afghanistan Asia      1952 28.801   8425333 779.4453
2 Afghanistan Asia      1957 30.332   9240934 820.8530
3 Afghanistan Asia      1962 31.997  10267083 853.1007
4 Afghanistan Asia      1967 34.020  11537966 836.1971
5 Afghanistan Asia      1972 36.088  13079460 739.9811
6 Afghanistan Asia      1977 38.438  14880372 786.1134
7 Afghanistan Asia      1982 39.854  12881816 978.0114
8 Afghanistan Asia      1987 40.822  13867957 852.3959

In [47]:
data |> slice_tail(n = 8)

  country  continent year lifeExp pop      gdpPercap
1 Zimbabwe Africa    1972 55.635   5861135 799.3622
2 Zimbabwe Africa    1977 57.674   6642107 685.5877
3 Zimbabwe Africa    1982 60.363   7636524 788.8550
4 Zimbabwe Africa    1987 62.351   9216418 706.1573
5 Zimbabwe Africa    1992 60.377  10704340 693.4208
6 Zimbabwe Africa    1997 46.809  11404948 792.4500
7 Zimbabwe Africa    2002 39.989  11926563 672.0386
8 Zimbabwe Africa    2007 43.487  12311143 469.7093

In [50]:
data |> slice_sample(n = 3)

  country     continent year lifeExp pop     gdpPercap
1 Congo, Rep. Africa    2007 55.322  3800610 3632.558
2 Oman        Asia      1957 40.080   561977 2242.747
3 Lebanon     Asia      1987 67.926  3089353 5377.091

In [52]:
data |> slice_min(lifeExp, n = 5)

  country      continent year lifeExp pop     gdpPercap
1 Rwanda       Africa    1992 23.599  7290203  737.0686
2 Afghanistan  Asia      1952 28.801  8425333  779.4453
3 Gambia       Africa    1952 30.000   284320  485.2307
4 Angola       Africa    1952 30.015  4232095 3520.6103
5 Sierra Leone Africa    1952 30.331  2143249  879.7877

In [55]:
data |> slice_max(lifeExp, n = 10)

   country          continent year lifeExp pop       gdpPercap
1  Japan            Asia      2007 82.603  127467972 31656.07
2  Hong Kong, China Asia      2007 82.208    6980412 39724.98
3  Japan            Asia      2002 82.000  127065841 28604.59
4  Iceland          Europe    2007 81.757     301931 36180.79
5  Switzerland      Europe    2007 81.701    7554661 37506.42
6  Hong Kong, China Asia      2002 81.495    6762476 30209.02
7  Australia        Oceania   2007 81.235   20434176 34435.37
8  Spain            Europe    2007 80.941   40448191 28821.06
9  Sweden           Europe    2007 80.884    9031088 33859.75
10 Israel           Asia      2007 80.745    6426679 25523.28

## `arrange()`

In [57]:
tmp <- data |> filter(year == 2007)

In [59]:
tmp |> head()

  country     continent year lifeExp pop      gdpPercap
1 Afghanistan Asia      2007 43.828  31889923   974.5803
2 Albania     Europe    2007 76.423   3600523  5937.0295
3 Algeria     Africa    2007 72.301  33333216  6223.3675
4 Angola      Africa    2007 42.731  12420476  4797.2313
5 Argentina   Americas  2007 75.320  40301927 12779.3796
6 Australia   Oceania   2007 81.235  20434176 34435.3674

In [63]:
tmp |> arrange(pop)|> tail(10)

   country       continent year lifeExp pop        gdpPercap
1  Mexico        Americas  2007 76.195   108700891 11977.575
2  Japan         Asia      2007 82.603   127467972 31656.068
3  Nigeria       Africa    2007 46.859   135031164  2013.977
4  Bangladesh    Asia      2007 64.062   150448339  1391.254
5  Pakistan      Asia      2007 65.483   169270617  2605.948
6  Brazil        Americas  2007 72.390   190010647  9065.801
7  Indonesia     Asia      2007 70.650   223547000  3540.652
8  United States Americas  2007 78.242   301139947 42951.653
9  India         Asia      2007 64.698  1110396331  2452.210
10 China         Asia      2007 72.961  1318683096  4959.115

In [66]:
tmp |> arrange(desc(pop))|> head(10)

   country       continent year lifeExp pop        gdpPercap
1  China         Asia      2007 72.961  1318683096  4959.115
2  India         Asia      2007 64.698  1110396331  2452.210
3  United States Americas  2007 78.242   301139947 42951.653
4  Indonesia     Asia      2007 70.650   223547000  3540.652
5  Brazil        Americas  2007 72.390   190010647  9065.801
6  Pakistan      Asia      2007 65.483   169270617  2605.948
7  Bangladesh    Asia      2007 64.062   150448339  1391.254
8  Nigeria       Africa    2007 46.859   135031164  2013.977
9  Japan         Asia      2007 82.603   127467972 31656.068
10 Mexico        Americas  2007 76.195   108700891 11977.575

In [71]:
tmp |> arrange(continent, country)|> tail(10)

   country         continent year lifeExp pop      gdpPercap
1  Serbia          Europe    2007 74.002  10150265  9786.535
2  Slovak Republic Europe    2007 74.663   5447502 18678.314
3  Slovenia        Europe    2007 77.926   2009245 25768.258
4  Spain           Europe    2007 80.941  40448191 28821.064
5  Sweden          Europe    2007 80.884   9031088 33859.748
6  Switzerland     Europe    2007 81.701   7554661 37506.419
7  Turkey          Europe    2007 71.777  71158647  8458.276
8  United Kingdom  Europe    2007 79.425  60776238 33203.261
9  Australia       Oceania   2007 81.235  20434176 34435.367
10 New Zealand     Oceania   2007 80.204   4115771 25185.009

## `mutate`

In [84]:
data_2007 <- data |>
    filter(year == 2007)

In [85]:
data_2007 <- data_2007 |>
    mutate(gdpTotal = pop * gdpPercap)

In [76]:
data_2007 |> head()

  country     continent year lifeExp pop      gdpPercap  gdpTotal
1 Afghanistan Asia      2007 43.828  31889923   974.5803  31079291949
2 Albania     Europe    2007 76.423   3600523  5937.0295  21376411360
3 Algeria     Africa    2007 72.301  33333216  6223.3675 207444851958
4 Angola      Africa    2007 42.731  12420476  4797.2313  59583895818
5 Argentina   Americas  2007 75.320  40301927 12779.3796 515033625357
6 Australia   Oceania   2007 81.235  20434176 34435.3674 703658358894

In [86]:
data_2007 <- data_2007 |>
    mutate(gdpTotal = pop * gdpPercap,
          country = toupper(country),
          lifeExp = round(lifeExp))
data_2007 |> head()

  country     continent year lifeExp pop      gdpPercap  gdpTotal
1 AFGHANISTAN Asia      2007 44      31889923   974.5803  31079291949
2 ALBANIA     Europe    2007 76       3600523  5937.0295  21376411360
3 ALGERIA     Africa    2007 72      33333216  6223.3675 207444851958
4 ANGOLA      Africa    2007 43      12420476  4797.2313  59583895818
5 ARGENTINA   Americas  2007 75      40301927 12779.3796 515033625357
6 AUSTRALIA   Oceania   2007 81      20434176 34435.3674 703658358894

`Europe` -> `EU`

In [87]:
data_2007 <- data_2007 |>
    mutate(
        continent = as.character(continent),
        continent = ifelse(continent == "Europe", "EU", continent),
        continent = as.factor(continent))

In [89]:
data_2007 |> head()

  country     continent year lifeExp pop      gdpPercap  gdpTotal
1 AFGHANISTAN Asia      2007 44      31889923   974.5803  31079291949
2 ALBANIA     EU        2007 76       3600523  5937.0295  21376411360
3 ALGERIA     Africa    2007 72      33333216  6223.3675 207444851958
4 ANGOLA      Africa    2007 43      12420476  4797.2313  59583895818
5 ARGENTINA   Americas  2007 75      40301927 12779.3796 515033625357
6 AUSTRALIA   Oceania   2007 81      20434176 34435.3674 703658358894

In [93]:
data_2007 |>
    transmute(gdpTotal = pop * gdpPercap) |>
    head()

  gdpTotal
1  31079291949
2  21376411360
3 207444851958
4  59583895818
5 515033625357
6 703658358894

## `rename`

In [102]:
data <- gapminder
data |> head()

  country     continent year lifeExp pop      gdpPercap
1 Afghanistan Asia      1952 28.801   8425333 779.4453
2 Afghanistan Asia      1957 30.332   9240934 820.8530
3 Afghanistan Asia      1962 31.997  10267083 853.1007
4 Afghanistan Asia      1967 34.020  11537966 836.1971
5 Afghanistan Asia      1972 36.088  13079460 739.9811
6 Afghanistan Asia      1977 38.438  14880372 786.1134

In [103]:
data <- data |>
    rename(population = pop)

In [104]:
data |> head()

  country     continent year lifeExp population gdpPercap
1 Afghanistan Asia      1952 28.801   8425333   779.4453
2 Afghanistan Asia      1957 30.332   9240934   820.8530
3 Afghanistan Asia      1962 31.997  10267083   853.1007
4 Afghanistan Asia      1967 34.020  11537966   836.1971
5 Afghanistan Asia      1972 36.088  13079460   739.9811
6 Afghanistan Asia      1977 38.438  14880372   786.1134

In [105]:
# rename_if

In [107]:
# rename_at

## `group_by` + `summarise`

In [109]:
data |> 
    filter(year == 2007) |>
    group_by(continent) |>
    summarise(
        lifeExp2007 = mean(lifeExp),
        countriesCount = n()
    )

  continent lifeExp2007 countriesCount
1 Africa    54.80604    52
2 Americas  73.60812    25
3 Asia      70.72848    33
4 Europe    77.64860    30
5 Oceania   80.71950     2

In [112]:
data |> 
    filter(year > 2000) |>
    group_by(continent, year) |>
    summarise(
        lifeExp2007 = mean(lifeExp),
        countriesCount = n(),
        population = sum(population)
    )

`summarise()` has grouped output by 'continent'. You can override using the
`.groups` argument.

   continent year lifeExp2007 countriesCount population
1  Africa    2002 53.32523    52              833723916
2  Africa    2007 54.80604    52              929539692
3  Americas  2002 72.42204    25              849772762
4  Americas  2007 73.60812    25              898871184
5  Asia      2002 69.23388    33             3601802203
6  Asia      2007 70.72848    33             3811953827
7  Europe    2002 76.70060    30              578223869
8  Europe    2007 77.64860    30              586098529
9  Oceania   2002 79.74000     2               23454829
10 Oceania   2007 80.71950     2               24549947

## `bind_`

In [117]:
data07 <- data |> 
    filter(year == 2007) |>
    group_by(continent) |>
    summarise(
        lifeExp = mean(lifeExp),
        countriesCount = n()
    )
data07 |> head()

  continent lifeExp  countriesCount
1 Africa    54.80604 52
2 Americas  73.60812 25
3 Asia      70.72848 33
4 Europe    77.64860 30
5 Oceania   80.71950  2

In [119]:
data02 <- data |> 
    filter(year == 2002) |>
    group_by(continent) |>
    summarise(
        lifeExp = mean(lifeExp),
        countriesCount = n()
    )
data02 |> head()

  continent lifeExp  countriesCount
1 Africa    53.32523 52
2 Americas  72.42204 25
3 Asia      69.23388 33
4 Europe    76.70060 30
5 Oceania   79.74000  2

In [124]:
data_all <- data02 |> bind_rows(data07)
data_all |> head(10)

   continent lifeExp  countriesCount
1  Africa    53.32523 52
2  Americas  72.42204 25
3  Asia      69.23388 33
4  Europe    76.70060 30
5  Oceania   79.74000  2
6  Africa    54.80604 52
7  Americas  73.60812 25
8  Asia      70.72848 33
9  Europe    77.64860 30
10 Oceania   80.71950  2

In [125]:
data07 <- data |> 
    filter(year == 2007) |>
    group_by(continent) |>
    summarise(
        lifeExp = mean(lifeExp),
        countriesCount = n()
    )
data07 |> head()

  continent lifeExp  countriesCount
1 Africa    54.80604 52
2 Americas  73.60812 25
3 Asia      70.72848 33
4 Europe    77.64860 30
5 Oceania   80.71950  2

In [127]:
data07_pop <- data |> 
    filter(year == 2007) |>
    group_by(continent) |>
    summarise(
        populatiom = sum(population)
    )
data07_pop |> head()

  continent populatiom
1 Africa     929539692
2 Americas   898871184
3 Asia      3811953827
4 Europe     586098529
5 Oceania     24549947

In [130]:
data_all <- data07 |> 
    bind_cols(data07_pop) |>
    select(-4) |>
    rename(continent = `continent...1`)
data_all |> head()

New names:
* `continent` -> `continent...1`
* `continent` -> `continent...4`

  continent lifeExp  countriesCount populatiom
1 Africa    54.80604 52              929539692
2 Americas  73.60812 25              898871184
3 Asia      70.72848 33             3811953827
4 Europe    77.64860 30              586098529
5 Oceania   80.71950  2               24549947

In [134]:
data07_pop <- data07_pop |> arrange(populatiom)
data07_pop |> head()

  continent populatiom
1 Oceania     24549947
2 Europe     586098529
3 Americas   898871184
4 Africa     929539692
5 Asia      3811953827

In [136]:
data_all <- data07 |> 
    bind_cols(data07_pop) 
data_all |> head()

New names:
* `continent` -> `continent...1`
* `continent` -> `continent...4`

  continent...1 lifeExp  countriesCount continent...4 populatiom
1 Africa        54.80604 52             Oceania         24549947
2 Americas      73.60812 25             Europe         586098529
3 Asia          70.72848 33             Americas       898871184
4 Europe        77.64860 30             Africa         929539692
5 Oceania       80.71950  2             Asia          3811953827

## `join`

In [137]:
data07 <- data |> 
    filter(year == 2007) |>
    group_by(continent) |>
    summarise(
        lifeExp = mean(lifeExp),
        countriesCount = n()
    )
data07 |> head()

  continent lifeExp  countriesCount
1 Africa    54.80604 52
2 Americas  73.60812 25
3 Asia      70.72848 33
4 Europe    77.64860 30
5 Oceania   80.71950  2

In [139]:
data07_pop <- data07_pop |> arrange(populatiom)
data07_pop |> head()

  continent populatiom
1 Oceania     24549947
2 Europe     586098529
3 Americas   898871184
4 Africa     929539692
5 Asia      3811953827

In [141]:
data_all <- data07 |>
    left_join(data07_pop, by = "continent")
data_all

  continent lifeExp  countriesCount populatiom
1 Africa    54.80604 52              929539692
2 Americas  73.60812 25              898871184
3 Asia      70.72848 33             3811953827
4 Europe    77.64860 30              586098529
5 Oceania   80.71950  2               24549947

In [143]:
first_df <- data.frame(Letter = c("A", "B", "C", "D", "E"),
                      Value = c(1:5))

second_df <- data.frame(Letter = c("A", "B", "C", "D", "F"),
                      Value = c(12, 7, 4, 1, 5))
first_df
second_df

  Letter Value
1 A      1
2 B      2
3 C      3
4 D      4
5 E      5

  Letter Value
1 A      12
2 B       7
3 C       4
4 D       1
5 F       5

In [145]:
first_df |> left_join(second_df, by = "Letter")

  Letter Value.x Value.y
1 A      1       12
2 B      2        7
3 C      3        4
4 D      4        1
5 E      5       NA

In [147]:
first_df |> right_join(second_df, by = "Letter")

  Letter Value.x Value.y
1 A       1      12
2 B       2       7
3 C       3       4
4 D       4       1
5 F      NA       5

In [149]:
first_df |> inner_join(second_df, by = "Letter")

  Letter Value.x Value.y
1 A      1       12
2 B      2        7
3 C      3        4
4 D      4        1

In [151]:
first_df |> full_join(second_df, by = "Letter")

  Letter Value.x Value.y
1 A       1      12
2 B       2       7
3 C       3       4
4 D       4       1
5 E       5      NA
6 F      NA       5

In [155]:
not_good_data <- data.frame(Name = c("Nick", "Jake", "Anna", "Jane", "Dina"),
                           q1_2021 = c(12442, 22131, 21343, 22111, 14123),
                           q2_2021 = c(13442, 22871, 20343, 22222, 14456),
                           q3_2021 = c(15482, 22031, 22456, 22444, 14533),
                           q4_2021 = c(14511, 20031, 21741, 22333, 14511))
not_good_data

  Name q1_2021 q2_2021 q3_2021 q4_2021
1 Nick 12442   13442   15482   14511
2 Jake 22131   22871   22031   20031
3 Anna 21343   20343   22456   21741
4 Jane 22111   22222   22444   22333
5 Dina 14123   14456   14533   14511

In [156]:
library(tidyr)

In [158]:
better_data <- not_good_data |>
    gather(quater, salary, 2:5)
better_data

   Name quater  salary
1  Nick q1_2021 12442
2  Jake q1_2021 22131
3  Anna q1_2021 21343
4  Jane q1_2021 22111
5  Dina q1_2021 14123
6  Nick q2_2021 13442
7  Jake q2_2021 22871
8  Anna q2_2021 20343
9  Jane q2_2021 22222
10 Dina q2_2021 14456
11 Nick q3_2021 15482
12 Jake q3_2021 22031
13 Anna q3_2021 22456
14 Jane q3_2021 22444
15 Dina q3_2021 14533
16 Nick q4_2021 14511
17 Jake q4_2021 20031
18 Anna q4_2021 21741
19 Jane q4_2021 22333
20 Dina q4_2021 14511

In [161]:
better_data <- not_good_data |>
    gather(quater, salary, q1_2021:q4_2021)
better_data |> head()

  Name quater  salary
1 Nick q1_2021 12442
2 Jake q1_2021 22131
3 Anna q1_2021 21343
4 Jane q1_2021 22111
5 Dina q1_2021 14123
6 Nick q2_2021 13442

In [164]:
best_data <- better_data |>
    separate(quater, c("quater", "year"), sep = "_") |>
    mutate(year = as.numeric(year),
          quater = substr(better_data$quater,2,2),
          quater = as.numeric(quater))
best_data

   Name quater year salary
1  Nick 1      2021 12442
2  Jake 1      2021 22131
3  Anna 1      2021 21343
4  Jane 1      2021 22111
5  Dina 1      2021 14123
6  Nick 2      2021 13442
7  Jake 2      2021 22871
8  Anna 2      2021 20343
9  Jane 2      2021 22222
10 Dina 2      2021 14456
11 Nick 3      2021 15482
12 Jake 3      2021 22031
13 Anna 3      2021 22456
14 Jane 3      2021 22444
15 Dina 3      2021 14533
16 Nick 4      2021 14511
17 Jake 4      2021 20031
18 Anna 4      2021 21741
19 Jane 4      2021 22333
20 Dina 4      2021 14511

In [166]:
best_data |> filter(Name == "Jane")

  Name quater year salary
1 Jane 1      2021 22111
2 Jane 2      2021 22222
3 Jane 3      2021 22444
4 Jane 4      2021 22333

In [169]:
united_data <- best_data |>
    unite(Qt_Y, quater, year, sep = "#", remove = F)
united_data

   Name Qt_Y   quater year salary
1  Nick 1#2021 1      2021 12442
2  Jake 1#2021 1      2021 22131
3  Anna 1#2021 1      2021 21343
4  Jane 1#2021 1      2021 22111
5  Dina 1#2021 1      2021 14123
6  Nick 2#2021 2      2021 13442
7  Jake 2#2021 2      2021 22871
8  Anna 2#2021 2      2021 20343
9  Jane 2#2021 2      2021 22222
10 Dina 2#2021 2      2021 14456
11 Nick 3#2021 3      2021 15482
12 Jake 3#2021 3      2021 22031
13 Anna 3#2021 3      2021 22456
14 Jane 3#2021 3      2021 22444
15 Dina 3#2021 3      2021 14533
16 Nick 4#2021 4      2021 14511
17 Jake 4#2021 4      2021 20031
18 Anna 4#2021 4      2021 21741
19 Jane 4#2021 4      2021 22333
20 Dina 4#2021 4      2021 14511

In [171]:
final_data <- better_data |>
    spread(quater, salary)
final_data

  Name q1_2021 q2_2021 q3_2021 q4_2021
1 Anna 21343   20343   22456   21741
2 Dina 14123   14456   14533   14511
3 Jake 22131   22871   22031   20031
4 Jane 22111   22222   22444   22333
5 Nick 12442   13442   15482   14511

In [172]:
gapminder |>
    select(country, lifeExp, year) |>
    spread(year, lifeExp) |>
    head()

  country     1952   1957   1962   1967   1972   1977   1982   1987   1992
1 Afghanistan 28.801 30.332 31.997 34.020 36.088 38.438 39.854 40.822 41.674
2 Albania     55.230 59.280 64.820 66.220 67.690 68.930 70.420 72.000 71.581
3 Algeria     43.077 45.685 48.303 51.407 54.518 58.014 61.368 65.799 67.744
4 Angola      30.015 31.999 34.000 35.985 37.928 39.483 39.942 39.906 40.647
5 Argentina   62.485 64.399 65.142 65.634 67.065 68.481 69.942 70.774 71.868
6 Australia   69.120 70.330 70.930 71.100 71.930 73.490 74.740 76.320 77.560
  1997   2002   2007
1 41.763 42.129 43.828
2 72.950 75.651 76.423
3 69.152 70.994 72.301
4 40.963 41.003 42.731
5 73.275 74.340 75.320
6 78.830 80.370 81.235